Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_init() FAIL, SPI busy???\r\n");
		return DS_Fail;
	}

	choose_hardware_config(am_i_wwf(), &SI446X_pin_setup);

	// Default settings
	si446x_channel = si446x_default_channel;
	tx_power = si446x_default_power;
	tx_msg_ptr = &tx_msg;
	rx_msg_ptr = &rx_msg;
	initSPI2();
	init_si446x_pins();

	si446x_reset();
	reset_errors  = si446x_part_info();
	reset_errors += si446x_func_info();
	si446x_get_int_status(0x0, 0x0, 0x0); // Saves status and clears all interrupts
	si446x_request_device_state();
	si446x_debug_print(DEBUG01, "SI446X: Radio Interrupts Cleared\r\n");

	temp = si446x_get_property(0x00, 0x01, 0x03);
	if (temp != RF_GLOBAL_CONFIG_1_1) {
		si446x_debug_print(ERR99, "SI446X: si446x_hal_init GLOBAL_CONFIG Setting Looks Wrong... Overriding...\r\n");
		si446x_set_property( 0x00, 0x01, 0x03, RF_GLOBAL_CONFIG_1_1 );
	}

	temp = si446x_get_property(0x12, 0x01, 0x08);
	if (temp != PKT_LEN) {
		si446x_debug_print(ERR99, "SI446X: si446x_hal_init PKT_LEN Setting Looks Wrong...Overriding...\r\n");
		si446x_set_property( 0x12, 0x01, 0x08, PKT_LEN );
	}

	temp = si446x_get_property(0x12, 0x01, 0x12);
	if (temp != PKT_FIELD_2_LENGTH) {
		si446x_debug_print(ERR99, "SI446X: si446x_hal_init PKT_FIELD_2_LENGTH Setting Looks Wrong...Overriding...\r\n");
		si446x_set_property( 0x12, 0x01, 0x12, PKT_FIELD_2_LENGTH );
	}

	si446x_fifo_info(0x3); // Reset both FIFOs. bit1 RX, bit0 TX
	si446x_debug_print(DEBUG01, "SI446X: Radio RX/TX FIFOs Cleared\r\n");

	isInit = 1;

	if ( reset_errors ) {
		ret = DS_Fail;
		si446x_debug_print(ERR100, "SI446X: si446x_hal_init(): reset failed.\r\n");
		goto si446x_hal_init_CLEANUP;
	}

	// Set MAC datastructures
	active_mac_index = radio_si446x_spi2.GetMacIdIndex();
	if(radio_si446x_spi2.Initialize(event_handler, mac_id) != DS_Success) {
		ret = DS_Fail;
		si446x_debug_print(ERR100, "SI446X: si446x_hal_init(): MAC init failed.\r\n");
		goto si446x_hal_init_CLEANUP;
	}

	{
		//Get cpu serial and hash it to use as node id. THIS IS NOT A DRIVER FUNCTION. MOVE TO MAC LAYER.
		UINT8 cpuserial[serial_size];
		memset(cpuserial, 0, serial_size);
		GetCPUSerial(cpuserial, serial_size);
		UINT16 tempNum=0;
		UINT16 * temp = (UINT16 *) cpuserial;
		for (int i=0; i< 6; i++){
			tempNum=tempNum ^ temp[i]; //XOR 72-bit number to generate 16-bit hash
		}
		radio_si446x_spi2.SetAddress(tempNum);
		si446x_debug_print(DEBUG02, "SI446X: CPU Serial Hash: 0x%.4X\r\n", tempNum);
	}

	// Init Continuations and interrupts
	// Leave these last in case something above fails.
	CPU_GPIO_EnableInputPin( SI446X_pin_setup.nirq_mf_pin, FALSE, si446x_spi2_handle_interrupt, GPIO_INT_EDGE_LOW, RESISTOR_DISABLED);
	tx_callback_continuation.InitializeCallback(tx_cont_do, NULL);
	rx_callback_continuation.InitializeCallback(rx_cont_do, NULL);
	int_defer_continuation.InitializeCallback(int_cont_do, NULL);

si446x_hal_init_CLEANUP:

	si446x_radio_unlock();
	si446x_spi_unlock();

	return ret;
}

// Hard radio shut-off. Does not check busy.
// This will ALWAYS shut down the radio regardless of MAC level status.
// TODO: Fix above.
DeviceStatus si446x_hal_uninitialize(UINT8 radio) {
	DeviceStatus ret = DS_Success;
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_uninitialize()\r\n");
	
	if ( !si446x_spi_lock() ) 	{ return DS_Fail; }
	if ( !isInit )				{ si446x_spi_unlock(); return DS_Fail; }
	
	isInit = 0;
	radio_shutdown(1);

	CPU_GPIO_DisablePin(SI446X_pin_setup.nirq_mf_pin, RESISTOR_DISABLED, 0, GPIO_ALT_PRIMARY); // Only PIN matters
	radio_si446x_spi2.SetInitialized(FALSE);
	ASSERT((active_mac_index & 0xFF00) == 0); // ??? copied from RF231 driver

	rx_callback = NULL;
	tx_callback = NULL;

	if(radio_si446x_spi2.UnInitialize((UINT8)active_mac_index) != DS_Success) {
		si446x_debug_print(ERR100, "SI446X: si446x_hal_uninitialize(): MAC UnInit failed.\r\n");
		ret = DS_Fail;
	}

	si446x_radio_unlock();
	si446x_spi_unlock();

	return ret;
}

// A full-stop reset of the chip. In the PAL API but you probably shouldn't be.
// Prefer to use UnInit() and Init() instead. --NPS
DeviceStatus si446x_hal_reset(UINT8 radio) {

	si446x_debug_print(ERR99, "SI446X: si446x_hal_reset(). PROBABLY A BAD IDEA. USE UNINIT() AND INIT() INSTEAD.\r\n");

	if ( !si446x_spi_lock() ) 	{ return DS_Fail; }

	si446x_reset();
	si446x_get_int_status(0x0, 0x0, 0x0); // Clear all interrupts.
	si446x_fifo_info(0x3); // Reset both FIFOs. bit1 RX, bit0 TX

	return DS_Success;
}

// Probably should not be in the driver...
UINT16 si446x_hal_get_address(UINT8 radio) {
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_get_address()\r\n");
	return radio_si446x_spi2.GetAddress();
}

// Probably should not be in the driver...
BOOL si446x_hal_set_address(UINT8 radio, UINT16 address) {
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_address()\r\n");
	return radio_si446x_spi2.SetAddress(address);
}

// eventTime is ignored unless doTS (USE_TIMESTAMP) is set.
DeviceStatus si446x_packet_send(uint8_t chan, uint8_t *pkt, uint8_t len, UINT32 eventTime, int doTS) {
	uint8_t tx_buf[si446x_packet_size+1]; // Add one for packet size field

	DeviceStatus ret = DS_Success;

	si446x_debug_print(DEBUG02, "SI446X: si446x_packet_send() size:%d doTs:%d\r\n", len, doTS);
	si446x_debug_print(DEBUG01, "\tcontents: %s\r\n", (char *)pkt);

	// First check if we have a previous send done and waiting to be processed
	if (tx_callback_continuation.IsLinked()) {
		// Lock and check again before we remove it.
		GLOBAL_LOCK(irq);
		if (tx_callback_continuation.IsLinked()) {
			tx_callback_continuation.Abort();
			irq.Release();
			tx_cont_do(NULL);
		} else {
			irq.Release();
		}
	}

	if ( len > si446x_packet_size || (doTS && (len > si446x_payload_ts)) ) {
		si446x_debug_print(ERR99, "SI446X: si446x_packet_send() Fail. Packet Too Large.\r\n");
		return DS_Timeout; // Cheating here. Not really a timeout but up a layer will return NO_BadPacket. TODO: Make proper.
	}

	if ( !isInit ) {
		si446x_debug_print(ERR99, "SI446X: si446x_packet_send() Fail. Not initialized.\r\n");
		return DS_Fail;
	}

