Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
	if ( !si446x_spi_lock() ) 	{
		si446x_debug_print(DEBUG02, "SI446X: si446x_packet_send() Fail. SPI locked, op in progress.\r\n");
		return DS_Busy;
	}

	// Lock radio until TX is done.
	if ( !si446x_radio_lock() ) 	{
		si446x_debug_print(DEBUG02, "SI446X: si446x_packet_send() Fail. Radio Op in progress.\r\n");
		ret = DS_Busy;
		goto si446x_packet_send_CLEANUP;
	}

	tx_buf[0] = len;
	if (doTS) { tx_buf[0] += 4; } // Add timestamp to packet size if used.
	memcpy(&tx_buf[1], pkt, len);

	si446x_write_tx_fifo(len+1, tx_buf); // add one for packet size


	if (doTS) { // Timestamp Case
		GLOBAL_LOCK(irq);

		// Go to TX_TUNE state now for minimum latency
		si446x_change_state(SI_STATE_TX_TUNE);
		while( si446x_request_device_state() != SI_STATE_TX_TUNE ) ; // spin. TODO: Add timeout.

		UINT32 eventOffset = (HAL_Time_CurrentTicks() & 0xFFFFFFFF) - eventTime;

		si446x_write_tx_fifo(4, (uint8_t*)&eventOffset); // generate and write timestamp late as possible.
		si446x_start_tx(chan, 0, tx_buf[0]+1);
		irq.Release();
	} else { // Normal Case
		si446x_start_tx(chan, 0, tx_buf[0]+1);
	}

si446x_packet_send_CLEANUP:

	si446x_spi_unlock();
	// RADIO STAYS LOCKED UNTIL TX DONE

	si446x_debug_print(DEBUG02, "SI446X: si446x_packet_send() TX Started Successfully\r\n");

	return ret;
}

void *si446x_hal_send(UINT8 radioID, void *msg, UINT16 size) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_send()\r\n");

	DeviceStatus ret;

	// Do the send
	ret = si446x_packet_send(si446x_channel, (uint8_t *) msg, size, 0, NO_TIMESTAMP);
	if (ret != DS_Success) {
		SendAckFuncPtrType AckHandler = radio_si446x_spi2.GetMacHandler(active_mac_index)->GetSendAckHandler();
		switch (ret) {
			case DS_Busy: 	(*AckHandler)(tx_msg_ptr, size, NetworkOperations_Busy, SI_DUMMY);			break;
			case DS_Timeout:(*AckHandler)(tx_msg_ptr, size, NetworkOperations_BadPacket, SI_DUMMY); 	break;
			default:		(*AckHandler)(tx_msg_ptr, size, NetworkOperations_Fail, SI_DUMMY); 		break;
		}
		return msg;
	}

	// exchange bags.
	Message_15_4_t* temp = tx_msg_ptr;
	tx_msg_ptr = (Message_15_4_t*) msg;

	return temp;
}

void *si446x_hal_send_ts(UINT8 radioID, void *msg, UINT16 size, UINT32 eventTime) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_send_ts()\r\n");

	DeviceStatus ret;

	// Do the send
	ret = si446x_packet_send(si446x_channel, (uint8_t *) msg, size, eventTime, YES_TIMESTAMP);
	if (ret != DS_Success) {
		SendAckFuncPtrType AckHandler = radio_si446x_spi2.GetMacHandler(active_mac_index)->GetSendAckHandler();
		switch (ret) {
			case DS_Busy: 	(*AckHandler)(tx_msg_ptr, size, NetworkOperations_Busy, SI_DUMMY);			break;
			case DS_Timeout:(*AckHandler)(tx_msg_ptr, size, NetworkOperations_BadPacket, SI_DUMMY);	break;
			default:		(*AckHandler)(tx_msg_ptr, size, NetworkOperations_Fail, SI_DUMMY);			break;
		}
		return msg;
	}

	// exchange bags.
	Message_15_4_t* temp = tx_msg_ptr;
	tx_msg_ptr = (Message_15_4_t*) msg;

	return temp;
}

// Does NOT set the radio busy unless a packet comes in.
DeviceStatus si446x_hal_rx(UINT8 radioID) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_rx()\r\n");
	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_rx() FAIL. SPI locked.\r\n");
		return DS_Fail;
	}
	if (!isInit) {
		si446x_spi_unlock();
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_rx() FAIL. Not Init.\r\n");
		return DS_Fail;
	}

	// Supposedly this property is squirrely and likes to mutate
	// This should be temp1==0 temp2==1 for 1-byte length field
	// Give it a couple of days, if not an issue can remove it.
	{
		uint8_t temp[2];
		si446x_get_property_multi(0x12, 0x02, 0x0D, temp);
		if (temp[0] != 0 || temp[1] != 1) {
			si446x_debug_print(ERR100, "SI446X: si446x_hal_rx() WARNING, PKT_FIELD_1_LENGTH mutation! Tell Nathan\r\n");
		}
	}

	si446x_start_rx_fast_channel(si446x_channel);
	si446x_spi_unlock();
	return DS_Success;
}

// This will cancel any radio ops, i.e unlocks the radio.
DeviceStatus si446x_hal_sleep(UINT8 radioID) {
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_sleep()\r\n");

	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_sleep() FAIL. SPI locked.\r\n");
		return DS_Fail;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_sleep() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_change_state(SI_STATE_SLEEP);

	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}


DeviceStatus si446x_hal_tx_power(UINT8 radioID, int pwr) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power()\r\n");

	if (pwr < 0) return DS_Fail; // Not worth of a printf

	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. SPI locked.\r\n");
		return DS_Fail;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( !si446x_radio_lock() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. Radio Busy.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_set_property( 0x22 , 1, 0x01, (uint8_t) pwr );
	tx_power = pwr;

	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}

DeviceStatus si446x_hal_set_channel(UINT8 radioID, int channel) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_set_channel()\r\n");
	if (channel < 0 ) return DS_Fail;

	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. SPI locked.\r\n");
		return DS_Fail;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( !si446x_radio_lock() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. Radio Busy.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_channel = channel;

	// Technically may not need the locks.
	// But could confuse the user otherwise.
	// And still at least protects the vars.
	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}


// Doesn't belong in radio driver... --NPS
//Properties of radio
static INT8 radioType;
void si446x_hal_set_RadioType(INT8 radio)
{
	radioType = radio;
}

// Doesn't belong in radio driver...
INT8 si446x_hal_get_RadioType()
{
	return radioType;
}

DeviceStatus si446x_hal_cca(UINT8 radioID) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca()\r\n");

	DeviceStatus ret;

